Belesprit26/gs_firmware/sdkconfig.defaults
# ── Target ─────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32c6"

# ── Flash (Seeed XIAO ESP32-C6 = 4 MB) ────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ── BLE (NimBLE) ──────────────────────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# ── WiFi ──────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_ENABLED=y

# ── NVS ───────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── Watchdog ──────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# ── Partition table ───────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Logging ───────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
